{
  "_name_or_path": "/data3/shl/checkpoints/M3D/Meta-Llama-3.1-8B-Instruct/",
  "architectures": [
    "LamedLlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "/storedata2/shl/checkpoints/M3D/llm/llm_open_dig_4-15/configuration_d3d_lamed.LamedConfig",
    "AutoModelForCausalLM": "/storedata2/shl/checkpoints/M3D/llm/llm_open_dig_4-15/modeling_d3d_lamed.LamedLlamaForCausalLM"
  },
  "bos_token_id": 128000,
  "eos_token_id": [
    128001,
    128008,
    128009
  ],
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "image_channel": 1,
  "image_size": [
    48,
    256,
    256
  ],
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 131072,
  "mlp_bias": false,
  "mm_hidden_size": 1024,
  "mm_projector_type": "spp",
  "model_type": "lamed_llama",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "patch_size": [
    8,
    16,
    16
  ],
  "pretraining_tp": 1,
  "proj_layer_num": 2,
  "proj_layer_type": "mlp",
  "proj_pooling_size": 2,
  "proj_pooling_type": "spatial",
  "rms_norm_eps": 1e-05,
  "rope_scaling": {
    "factor": 8.0,
    "type": "dynamic"},
  "rope_theta": 500000.0,
  "seg_token_id": 128259,
  "tie_word_embeddings": false,
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "use_cache": true,
  "vision_select_feature": "patch",
  "vision_select_layer": -1,
  "vision_tower": "swin3d",
  "vocab_size": 128260
}
